# Groupby in Pandas
- The groupby() method in Pandas is a powerful function used for splitting a DataFrame into groups based on specified criteria, applying a function to each group, and then combining the results. This follows the "split-apply-combine" strategy and is essential for data analysis and manipulation in Python.

In [3]:
import pandas as pd

var = pd.DataFrame({"name": ["a","b","c","d","a","b","a","b","a","c","c","d"],
                   "S_1": [12,13,14,12,13,14,15,23,25,16,10,34],
                   "S_2": [23,24,25,26,27,28,29,30,25,34,35,56]})
var

   name  S_1  S_2
0     a   12   23
1     b   13   24
2     c   14   25
3     d   12   26
4     a   13   27
5     b   14   28
6     a   15   29
7     b   23   30
8     a   25   25
9     c   16   34
10    c   10   35
11    d   34   56

## Groupby:- Make group i.e. The data of a is one side, b is another side like this

In [10]:
var_new = var.groupby("name") 
var_new

In [16]:
# for showing the data of above stored 
for x,y in var_new:
    print(x)
    print(y)
    print()

a
  name  S_1  S_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25

b
  name  S_1  S_2
1    b   13   24
5    b   14   28
7    b   23   30

c
   name  S_1  S_2
2     c   14   25
9     c   16   34
10    c   10   35

d
   name  S_1  S_2
3     d   12   26
11    d   34   56

## If we want only 1 particular group,
- get_group() is used

In [26]:
var_new.get_group("a")

  name  S_1  S_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25

## To find maximum, minimum, mean value,

In [36]:
var_new.min()

      S_1  S_2
name
a      12   23
b      13   24
c      10   25
d      12   26

In [38]:
var_new.max()

      S_1  S_2
name
a      25   29
b      23   30
c      16   35
d      34   56

In [40]:
var_new.mean()

            S_1        S_2
name
a     16.250000  26.000000
b     16.666667  27.333333
c     13.333333  31.333333
d     23.000000  41.000000

## Converting into the list

In [45]:
li = list(var_new)
li

[('a',
    name  S_1  S_2
  0    a   12   23
  4    a   13   27
  6    a   15   29
  8    a   25   25),
 ('b',
    name  S_1  S_2
  1    b   13   24
  5    b   14   28
  7    b   23   30),
 ('c',
     name  S_1  S_2
  2     c   14   25
  9     c   16   34
  10    c   10   35),
 ('d',
     name  S_1  S_2
  3     d   12   26
  11    d   34   56)]